Revit 2024 API
ElectricalAnalyticalLoadSet.QuantityOnStandBy Property
 The number of Equipment Loads that are not operational at any time.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int QuantityOnStandBy { get; set; }
Visual Basic
Public Property QuantityOnStandBy As Integer
	Get
	Set
Visual C++
public:
property int QuantityOnStandBy {
	int get ();
	void set (int value);
}
Remarks
 The equipment loads with smaller load value within the set are considered on standby. Must be between 0 and (total count of the Equipment Loads in the LoadSet)
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The number is greater than the total count of the Equipment Loads in the LoadSet.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for number is negative.
See Also
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace